{"inkVersion":20,"root":[["\n","^Sup. ",{"#":"speaker:Drazie"},{"#":"portrait:default"},{"#":"player portrait:noxie_neutral"},{"#":"layout:right"},"\n","^Looks like you made it to the end of the demo. Congrats.","\n","^I'm actually based on the creator, soooo I guess I'm the self insert.","\n","^Since this is the end of the demo, I'll just ramble a bit about making the game!","\n","^Feel free to like, quit or something.","\n","^I lost a lot of motivation this quarter, to be honest.","\n","^I spend a lot of time on concepting and ideation, but actually putting things in motion for a project like this doesn't come easily to me, haha.","\n","^My favorite part of this project are the cutscenes.","\n","^It is one of the only systems I designed entirely on my own, and I felt like I was really able to put what I learned into practice.","\n","^The animatics I threw together are fun, too.","\n","^I think this method of storytelling is almost like a motivator to see the next cutscene or the next piece of story or worldbuilding.","\n","^Not to mention, it's much easier than trying to figure out how to animate the characters in-game.","\n","^I had an idea to let the player view replays of these cutscenes in Mortis' tower, if I could have gotten to that point.","\n","^The player would hook their brain up to a crt-tv and choose which scenes to replay as if you're viewing memories.","\n","^Anyway, thanks for playing.","\n","^See ya.","\n","end",["done",{"#f":5,"#n":"g-0"}],null],"done",{"global decl":["ev",false,{"VAR=":"essence_activate"},"str","^","/str",{"VAR=":"essence_name"},false,{"VAR=":"has_rawEssence"},"str","^Noxie","/str",{"VAR=":"power_name"},"str","^","/str",{"VAR=":"correct_power"},0.02,{"VAR=":"typing_speed"},false,{"VAR=":"cutscene"},false,{"VAR=":"mortis_completed"},false,{"VAR=":"mortis_met"},false,{"VAR=":"ciara_completed"},false,{"VAR=":"ciara_met"},false,{"VAR=":"ciara_reading"},false,{"VAR=":"ana_met"},false,{"VAR=":"ana_completed"},false,{"VAR=":"ana_reading"},false,{"VAR=":"pedia_completed"},false,{"VAR=":"pedia_met"},"/ev","end",null],"#f":1}],"listDefs":{}}