{"inkVersion":20,"root":[["^Sup. ",{"#":"speaker:Drazie"},{"#":"portrait:drazie_neutral"},{"#":"player portrait:noxie_neutral"},{"#":"layout:right"},"\n","^Looks like you made it to the end of the demo. Congrats.","\n","^I'm actually based on the creator, soooo I guess I'm the self insert.","\n","^Like this is my dragon-demon sona. ",{"#":"portrait:drazie_dragon"},"\n","^...","\n","^Anyway ",{"#":"portrait:drazie_neutral"},"\n","^Since this is the end of the demo, I'll just ramble about the game!","\n","^Feel free to like, quit or something.","\n",{"->":"Q"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Q":[["ev","str","^What was it like making this?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Any future plans or scrapped ideas?","/str","/ev",{"*":".^.c-1","flg":20},{"*":".^.c-2","flg":24},{"c-0":["^ ",{"->":"experience"},"\n",{"#f":5}],"c-1":["^ ",{"->":"plans"},"\n",{"#f":5}],"c-2":[{"->":"cont"},"\n",{"#f":5}]}],{"#f":1}],"experience":["^I lost a lot of motivation this quarter, to be honest.","\n","^I spent a lot of time on concepting and ideation, but actually putting things in motion for a project like this doesn't come easily to me, haha.","\n","^I still wonder if my idea for this game is solid enough...","\n","^Another reason is that I also have another game I'm working on, on the side.","\n","^It's a visual novel, so it's much easier to work on and there's no learning curve for me, unlike in Unity.","\n","^I thought I would make a variety of expressions for the characters, but I ended up needing to spend more time on piecing everything together to be playable.","\n","^It was difficult to sit down and FOCUS to learn what I need to learn.","\n","^It's really easy to get distracted.","\n","^I think I got the basics down, though.","\n","^My favorite system is the cutscene manager.","\n","^It is one of the only systems I designed entirely on my own, and I felt like I was really able to put what I learned into practice.","\n","^The animatics I threw together are fun, too.","\n","^I kinda wish I put more effort into them, though.","\n","^I think this method of storytelling is almost like a motivator to see the next cutscene or the next piece of story or worldbuilding.","\n","^Not to mention, it's much easier and more expressive than trying to figure out how to animate the characters in-game.","\n","^Something that keeps me going in projects when I lose interest is I find something that I wanna do personally for fun.","\n","^Here, it's clearly this little endgame area. I really enjoy adding \"dev talk back\" in my games when applicable.","\n","^Did you like those cutscenes?","\n","^Those are the two types of cutscenes that my system can produce, one that plays in the middle of dialogue (and can even be a dialogue trigger), and one that plays automatically with some dialogue after.","\n","^I guess it can also teleport you and enable/disable objects...","\n","^And it's clearly still buggy somewhat...","\n","^Still, it's something I figured out on my own.","\n","^Ya know, the process of making something on my own and going through the whole thing has made me more confident in branching out into other game engines and just making games in general.","\n","^You just gotta dive right in, as most would say.","\n",{"->":"Q"},{"#f":1}],"plans":[["^Of course I had a lot of ideas right at the start.","\n","^This world is something that I've been concepting for a long time, and I only adapted it a bit to fit this type of game style.","\n","^I often have dreams where I see a character so vividly that I'm able to draw them later. This world was constructed as a way to house some of them.","\n","^Noxie's original concept is pretty similar to how they're like now. They're resurrected, then goes on a quest for revenge.","\n","^They drag Dearil along, since he was the one who is able to keep them alive.","\n","^In the game, I ended up altering the circumstances a bit, of course.","\n","^When I first drafted the game, I wanted Noxie's personality to be where it would be at the \"end\" of their journey- where they're more extroverted and loud and fun.","\n","^This was because I was leaning towards a more... low stakes story?","\n","^That didn't make sense with their current design, and there's nowhere narratively for Noxie to go from there, so I reverted them back.","\n","^I had this one idea to let the player view replays of cutscenes in Mortis' tower, as a stretch goal.","\n","^The player would hook their brain up to a crt-tv and choose which scenes to replay as if you're viewing memories.","\n","^In terms of the gameplay, I did scrap several ideas.","\n","^I wanted there to be boss fights, like Cuphead or Hollow Knight, as well as platforming sections between settlements.","\n","^Clearly, very out of scope, haha.","\n","^I figured I would just lean into the artistic elements rather than the technical elements and shifted the game to be more like a visual novel you can walk around in.","\n","^I wanted to include four levels, each representing a distinct \"continent\" or \"district\" of the world.","\n","^There's the Decay Domain, where you start, the Botanical/Lush Domain, the Temperamental Domain, and the Topsy-Turvy Domain.","\n","^It's very inspired by 1-Bit Heart, actually, if you've heard of it.","\n","^I realized my drive to make art was dwindling and that I was missing some stuff on the programming side I hadn't covered last quarter, so I pivoted to only adding the gameplay components for this first area.","\n","^Hey, speaking of extra lore... want to hear a bit more about this Domain's worldbuilding?","\n","ev","str","^Hell yeah I love lore","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^No thanks...","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"decay"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Q"},"\n","end",{"#f":5}]}],{"#f":1}],"decay":["^Despite the name, the Decay Domain is actually the land of reincarnation.","\n","^Dead bodies from all over are buried here and decay into the soil. Then, the soil is turned into clay to be used to make new bodies.","\n","^The soulplants, over a very very long amount of time, produce souls.","\n","^Typically, souls used for bodies are reused from those who passed. After a certain amount of cycles, the soul will probably fizzle out or be returned to the earth like bodies.","\n","^Bodies and souls are put together in this sort of swirling vortex, which takes them out of the Decay Domain and into a central \"hub\" Domain where all new life is spat out.","\n","^I haven't really thought enough about how it works, but the point is that a new demon is supposed to travel the world and find where they belong.","\n","^Like finding yourself and where you're meant to be is central to their society.","\n","^human souls also pass through here, but they're simply passed back to the human world instead of being assigned a body.","\n","^Sort of explained with the soulplants, but the land you walk upon is alive.","\n","^It naturally produces demons on it's own, even without the help of people like Ana who assist in the process.","\n","^Because this area is also known to collect history, I'd imagine that demons who settle here built their little society around organizing the reincarnation process.","\n","^I hope that helps explain what's happening here a bit?","\n",{"->":"Q"},{"#f":1}],"cont":["^Well anyway thanks for playing.","\n","^I have one last little secret for you.","\n","^All you gotta do is walk past me.","\n","^See ya.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}