{"inkVersion":20,"root":[["\n","ev",{"VAR?":"has_rawEssence"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"essence"},{"->":"0.5"},null]}],"nop","\n","^Hi! Hello! Salutations! ",{"#":"speaker:Mortis"},{"#":"portrait:mortis_happy"},{"#":"layout:right"},{"#":"player portrait:noxie_thinking"},"\n","^I see that you've already started walking, so why don't we hurry along with the readjustment period? ",{"#":"layout:right"},"\n","^How are those relatively new limbs treating you?","\n","^Can you tell me what happened to me first? ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^I can't remember anything...","\n","^Oh my. ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","^Oh my my my","\n","^This. Is absolutely. WONDERFUL!","\n","^Can you count to five for me? Tell me what's on your mind, are you certain you remember nothing? At least you remember how to speak it seems... How many fingers am I holding up?","\n","^One, two, three, four, five? Uh... remember... remember... ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^Wait","\n","^Why am I doing this","\n","^Who are you?!","\n","^This is a major breakthrough! ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","^You're talking back, thinking for yourself, asking questions!","\n","^I believe I may have finally done it!","\n","^DONE WHAT??? ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^Necromancy, my friend! ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","^But not just any necromancy, no no no we are not so simple here.","\n","^I caught your faint little human soul and reengineered it for a demon's body.","\n","^Truly fascinating stuff!","\n","^You don't know how many times I've gone through this experiment-","\n","^Wait, I DIED??? ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^Like, all the way?","\n","^Also... I'm a demon now? Does that mean this is Hell? Are you the Grim Reaper?","\n","^Calm down, calm down, I am no such thing. ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","^And this is not the Hell you might be imagining, in fact I think the denizens of this place are quite the colorful characters!","\n","^Not to mention, you're one of them now, so do not worry about standing out from the crowd.","\n","^I wish I could remember what my life was like before I died so I know how mad I should be right now. ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^Or... maybe grateful? Hm...","\n","^Your memory loss is unsurprising. I was unsure how stable they would be travelling from your physical body to your formless soul. ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","^You may not even be able to recover them in full, if at all!","\n","^Great... ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^Bah, I say do not dwell on the past. You cannot change what you cannot change. ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","^All of the action is right here in the present, and our potential in our future!","\n","^Wow, did you come up with that catchphrase too? ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^I spend many hours on my patents. ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","^Moving on!","\n","^Now that we have established that the transfer was successful, there is something peculiar about this world that I want to explore with you.","\n","^I need you to collect something called essences. They are a part of a demon's soul that in part forms their identity.","\n","^I've observed that demons are able to exchange their essences with each other at their leisure.","\n","^These essences are malleable and change as they're passed from person to person, like they are adapting to the new host in a way.","\n","^Typically a human soul should not be able to infuse a demon's essence, but you are special!","\n","^Not only because your soul has already been fused with a demon's body, but because your body is malleable as well.","\n","^Uh, okay...? ",{"#":"speaker:Noxie"},{"#":"layout:left"},"\n","^Will that, like, hurt?","\n","^Probably not! ",{"#":"speaker:Mortis"},{"#":"layout:right"},"\n","ev",{"VAR?":"has_rawEssence"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"0.143"},null]}],[{"->":".^.b"},{"b":["^You'll find out once you find someone who will lend you their essence. Come back to me so I may study the results, please!",{"->":"0.143"},null]}],"nop","\n","end",["done",{"#f":5,"#n":"g-0"}],null],"done",{"essence":["^I see you've found an essence from someone!",{"#":"speaker:Mortis"},{"#":"portrait:mortis_happy"},{"#":"layout:right"},"\n","^As I suspected, you can't interact with it as demons normally would.","\n","^Allow me.","\n","^(Mortis inserts the essence into some kind of machine. It groans and creaks as it processes it.) ",{"#":"portrait:invisiblePortrait"},{"#":"layout:none"},"\n","^(Eventually it finishes the task and a glass tube opens up to reveal a pair of arms.)","\n","^Voila! I have made you a new pair of arms! ",{"#":"portrait:mortis_happy"},{"#":"layout:right"},"\n","^How did you do that???",{"#":"speaker:Noxie"},{"#":"portrait:default"},{"#":"layout:left"},"\n","^As much as I would love to get into the details, I shall simplify it for you.",{"#":"speaker:Mortis"},{"#":"portrait:mortis_happy"},{"#":"layout:right"},"\n","^Very very verrry simply, I took that essence and infused it with the preserved limbs of a recently deceased.","\n","^And now you should be able to detach those arms and equip these ones and use their power!","\n","^All thanks to my genuis.","\n","ev",false,"/ev",{"VAR=":"has_rawEssence","re":true},"ev","str","^Ciara","/str","/ev",{"VAR=":"power_name","re":true},"ev","str","^","/str","/ev",{"VAR=":"essence_name","re":true},"end",{"#f":1}],"global decl":["ev","str","^","/str",{"VAR=":"essence_name"},"str","^","/str",{"VAR=":"power_name"},false,{"VAR=":"has_rawEssence"},false,{"VAR=":"Ciara_completed"},"/ev","end",null],"#f":1}],"listDefs":{}}