{"inkVersion":20,"root":[["\n","ev",{"VAR?":"has_rawEssence"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"essence"},{"->":"0.5"},null]}],"nop","\n","^Hello! Hi! Salutations! ",{"#":"speaker:Mortis"},{"#":"portrait:mortis_happy"},{"#":"layout:right"},{"#":"player portrait:noxie_thinking"},"\n","^You've already started walking, so why don't we hurry along with the readjustment period? ",{"#":"layout:right"},"\n","^How are those relatively new limbs treating you?","\n","ev","str","^\"Was I in an accident?\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"Who are you?\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"dead"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"who"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"dead":["^How you died I'm not certain of, but how you're here is my doing!","\n","^I caught your faint little human soul and reengineered it for a demon's body.","\n","^Truly fascinating stuff!","\n",{"->":"cont"},{"#f":1}],"who":["^Curious about me?","\n","^Why, I'm Mortis, of course! The Decay Domain's leading scientist in the field of necromancy!","\n",{"->":"cont"},{"#f":1}],"cont":["^It seems like your cognitive pathways are functional. Wonderful!","\n","^It's very likely that you do not retain any memories from your past life as of now, but this is perfectly natural!","\n","^Over time, you should start to recall your past, if my theories are correct.","\n","^Now for the next part of my hypothesis, I need you to collect something called essences. They are a part of a demon's soul that in part forms their identity.","\n","^I've observed that demons are able to exchange their essences with each other at their leisure.","\n","^These essences are malleable and change as they're passed from person to person, like they are adapting to the new host in a way.","\n","^By infusing them into your soul, you physically adopt new characteristics such as powers and growths upon your body.","\n","^Typically a human soul should not be able to infuse a demon's essence, but you are special!","\n","^Not only because your soul has already been fused with a demon's body, but because your body is malleable as well.","\n","ev",{"VAR?":"has_rawEssence"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"cont.23"},null]}],[{"->":".^.b"},{"b":["^Before I continue my incessant ramblings, why don't you try finding someone willing to share their essence with you? Come back to me when you when you have.",{"->":"cont.23"},null]}],"nop","\n","end",{"#f":1}],"essence":["^I see you've found an essence from someone!",{"#":"speaker:Mortis"},{"#":"portrait:mortis_happy"},{"#":"layout:right"},"\n","^As I suspected, you can't interact with it as demons normally would.","\n","^Allow me.","\n","^(Mortis inserts the essence into some kind of machine. It groans and creaks as it processes it.) ",{"#":"portrait:invisiblePortrait"},{"#":"layout:none"},"\n","^(Eventually it finishes the task and a glass tube opens up to reveal a pair of arms.)","\n","^Voila! I have made you a new pair of arms! ",{"#":"portrait:mortis_happy"},{"#":"layout:right"},"\n","^How did you do that???",{"#":"speaker:Noxie"},{"#":"portrait:default"},{"#":"layout:left"},"\n","^As much as I would love to get into the details, I shall simplify it for you.",{"#":"speaker:Mortis"},{"#":"portrait:mortis_happy"},{"#":"layout:right"},"\n","^Very very verrry simply, I took that essence and infused it with the preserved limbs of a recently deceased.","\n","^And now you should be able to detach those arms and equip these ones and use their power!","\n","^All thanks to my genuis.","\n","ev",false,"/ev",{"VAR=":"has_rawEssence","re":true},"ev","str","^Ciara","/str","/ev",{"VAR=":"power_name","re":true},"ev","str","^","/str","/ev",{"VAR=":"essence_name","re":true},"end",{"#f":1}],"global decl":["ev","str","^","/str",{"VAR=":"essence_name"},"str","^","/str",{"VAR=":"power_name"},false,{"VAR=":"has_rawEssence"},false,{"VAR=":"Ciara_completed"},"/ev","end",null],"#f":1}],"listDefs":{}}